{
  "range": "agenda!A1:Z1000",
  "majorDimension": "ROWS",
  "values": [
    [
      "Mes",
      "Dia",
      "Dia da Semana",
      "Início",
      "Fim",
      "Título",
      "Sinopse",
      "Palestrante",
      "Origem",
      "Subtítulo do Palestrante",
      "Biografia",
      "Foto"
    ],
    [
      "set",
      "9",
      "Quarta",
      "19:00",
      "20:15",
      "Computação aplicada à saúde: oportunidades em pesquisa e desenvolvimento",
      "A área de saúde  tem sido um dos setores da sociedade mais beneficiados com a Computação, ao mesmo tempo em que impulsiona o desenvolvimento de diversas pesquisas computacionais. No entanto,  há um \"gap\" entre as necessidades da saúde e a formação de alunos de graduação, podendo gerar despreparo e consequente perda de oportunidades. Nesta palestra é apresentada uma visão geral sobre necessidades proeminentes da saúde que podem se converter em oportunidades de pesquisa e desenvolvimento. Em especial, são abordadas algumas aplicações na área de processamento gráfico como exemplos de oportunidades. ",
      "Fátima Nunes",
      "EACH",
      "Professora",
      "Professora titular da Universidade de São Paulo (USP), pesquisadora da área de processamento gráfico, com ênfase em Realidade Virtual, Processamento de Imagens, Recuperação de dados multimídia por conteúdo.  Suas pesquisas são majoritariamente aplicadas à área de saúde. Atualmente é presidente da Comissão de Pós-Graduação da Escola de Artes, Ciências e Humanidades (EACH) e Diretora do Centro de Tecnologia de Informação de São Paulo (USP)",
      "res/faces/profile.jpg"
    ],
    [
      "set",
      "9",
      "Quarta",
      "20:30",
      "21:45",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "res/faces/profile.jpg"
    ],
    [
      "set",
      "10",
      "Quinta",
      "19:00",
      "20:15",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "res/faces/profile.jpg"
    ],
    [
      "set",
      "10",
      "Quinta",
      "20:30",
      "21:45",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "res/faces/profile.jpg"
    ],
    [
      "set",
      "11",
      "Sexta",
      "19:00",
      "20:15",
      "Arquitetura Reativa Nativa à Nuvem: Padrões para Resiliência e Escalabilidade de Microsserviços",
      "Microsserviços ganharam ampla adoção no mercado para o desenvolvimento de sistemas complexos. Entretanto, garantir a resiliência e a escalabilidade destes sistemas ainda é um desafio, em particular no que diz respeito ao gerenciamento de dados. Nessa palestra, apresentaremos alguns padrões de microsserviços que, em conjunto, ajudam a atender esses requisitos. Mostraremos como eles permitem criar uma arquitetura que combina os conceitos de aplicações reativas (reactive) e nativas à nuvem (cloud-native), discutindo os custos e benefícios associados",
      "Renato Cordeiro Ferreira",
      "Elo7",
      "Em Breve",
      "Engenheiro de Aprendizagem de Máquina no Elo7, interessado em colocar modelos de IA em produção. Mestre em Computação pelo IME-USP, estudando sobre Engenharia de Software e Ciência de Dados. É co-fundador e coordenador do CodeLab, grupo de extensão inter-universitário cuja missão é estimular a inovação tecnológica. Entusiasta de hackathons, também é idealizador do HackathonUSP / InterHack.",
      "res/faces/profile.jpg"
    ],
    [
      "set",
      "11",
      "Sexta",
      "20:30",
      "21:45",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "res/faces/profile.jpg"
    ],
    [
      "set",
      "12",
      "Sábado",
      "15:00",
      "16:15",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "res/faces/profile.jpg"
    ],
    [
      "set",
      "12",
      "Sábado",
      "16:30",
      "17:45",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "res/faces/profile.jpg"
    ],
    [
      "set",
      "12",
      "Sábado",
      "18:00",
      "19:15",
      "Neovim",
      "Neovim: o que me inspirou, os objetivos iniciais e um\noverview do que foi feito nos dois anos iniciais em que fiquei na\nfrente do projeto.",
      "Thiago Padilha",
      "Neovim",
      "Criador do Neovim",
      "Em 2004 iniciou o curso de engenharia mecânica na UFPE. Desde o início já estudava programação por conta própria (começou com VBA no Excel) e por volta de 2006 resolveu largar o curso. Até por volta de 2011 foi programador em várias empresas locais.\u003cbr/\u003e\u003cbr/\u003eNo final de 2013 a idéia do Neovim surgiu em sua cabeça, mas só em 2014 que o projeto saiu do papel quando a campanha do bountysource foi bem sucedida. Trabalhou full time no projeto até 2016.\u003cbr/\u003e\u003cbr/\u003eAtualmente é contractor para uma empresa nos Estados Unidos.",
      "res/faces/profile.jpg"
    ],
    [
      "set",
      "12",
      "Sábado",
      "19:30",
      "20:45",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "Em Breve",
      "res/faces/profile.jpg"
    ]
  ]
}
